app/views/articles/show.html.erb

  <div class="more-info">
  <%= link_to "Back to Group", group_path(@article.group) %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]