app/views/groups/show.html.erb

SELECT  "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = $1 AND "users"."id" = $2 LIMIT 1  [["group_id", 1], ["id", 1]]
---
      <h3> Current Members (Click on a member's name to send that person an email)</h3>
      <% @group.users.each do |user| %>

SELECT "articles".* FROM "articles" WHERE "articles"."group_id" = ?  [["group_id", 1]]
SELECT  "versions".* FROM "versions" WHERE "versions"."article_id" = ?  ORDER BY "versions"."id" DESC LIMIT 1  [["article_id", 1]]
---
  <ul>
  <% @group.articles.each do |article| %>
     <li><%= link_to article.versions.last.title, article_path(article) %> - updated <%= article.versions.last.created_at.strftime("%m/%d %H:%M %p") %> - <%= link_to "Edit article", new_article_version_path(article) %></li>