app/views/versions/index.html.erb

SELECT  "versions".* FROM "versions" WHERE "versions"."article_id" = ?  ORDER BY "versions"."id" DESC LIMIT 1  [["article_id", 1]]
---
  <ul>
  <% @article.versions.reverse.each do |version| %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]
---
  <br>
  <%= link_to "Back to Group", group_path(@article.group) %>