app/views/versions/show.html.erb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 5]]
---
  <div class="group-link">
  <%= link_to "Back to Group", group_path(@version.article.group) %>