app/controllers/articles_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "articles" ("group_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["group_id", 1], ["created_at", "2015-09-15 18:52:55.625994"], ["updated_at", "2015-09-15 18:52:55.625994"]]
INSERT INTO "versions" ("title", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hey"], ["body", "hey is this working?"], ["article_id", 8], ["created_at", "2015-09-15 19:37:17.270572"], ["updated_at", "2015-09-15 19:37:17.270572"]]
---
  def create
    @group = Group.find_by(id: params[:group_id])
    @article = Article.new
    @group.articles << @article
    @version = Version.new(version_params)
    @article.versions << @version

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @group = Group.find_by(id: params[:group_id])

SELECT  "versions".* FROM "versions" WHERE "versions"."article_id" = ?  ORDER BY "versions"."id" DESC LIMIT 1  [["article_id", 1]]
---
  def show
    @latest_version = Version.where(article_id: params[:id]).last

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_article
    @article = Article.find(params[:id])