app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @membership = Membership.new
    @group = Group.find_by(id: params[:id])