app/controllers/versions_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_article
    @article = Article.find(params[:article_id])

SELECT  "versions".* FROM "versions" WHERE "versions"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_version
    @version = Version.find(params[:id])